espressif/esp-idf/components/soc/esp32c6/include/soc/host_reg.h
/** SLCHOST_SLC1HOST_RX_INFOR_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_INFOR_REG (DR_REG_SLCHOST_BASE + 0xf8)
/** SLCHOST_SLC1HOST_RX_INFOR : R/W; bitpos: [19:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_INFOR    0x000FFFFFU
#define SLCHOST_SLC1HOST_RX_INFOR_M  (SLCHOST_SLC1HOST_RX_INFOR_V << SLCHOST_SLC1HOST_RX_INFOR_S)
#define SLCHOST_SLC1HOST_RX_INFOR_V  0x000FFFFFU
#define SLCHOST_SLC1HOST_RX_INFOR_S  0

/** SLCHOST_SLC0HOST_LEN_WD_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_LEN_WD_REG (DR_REG_SLCHOST_BASE + 0xfc)
/** SLCHOST_SLC0HOST_LEN_WD : R/W; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_LEN_WD    0xFFFFFFFFU
#define SLCHOST_SLC0HOST_LEN_WD_M  (SLCHOST_SLC0HOST_LEN_WD_V << SLCHOST_SLC0HOST_LEN_WD_S)
#define SLCHOST_SLC0HOST_LEN_WD_V  0xFFFFFFFFU
#define SLCHOST_SLC0HOST_LEN_WD_S  0

/** SLCHOST_SLC_APBWIN_WDATA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_WDATA_REG (DR_REG_SLCHOST_BASE + 0x100)
/** SLCHOST_SLC_APBWIN_WDATA : R/W; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_WDATA    0xFFFFFFFFU
#define SLCHOST_SLC_APBWIN_WDATA_M  (SLCHOST_SLC_APBWIN_WDATA_V << SLCHOST_SLC_APBWIN_WDATA_S)
#define SLCHOST_SLC_APBWIN_WDATA_V  0xFFFFFFFFU
#define SLCHOST_SLC_APBWIN_WDATA_S  0

/** SLCHOST_SLC_APBWIN_CONF_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_CONF_REG (DR_REG_SLCHOST_BASE + 0x104)
/** SLCHOST_SLC_APBWIN_ADDR : R/W; bitpos: [27:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_ADDR    0x0FFFFFFFU
#define SLCHOST_SLC_APBWIN_ADDR_M  (SLCHOST_SLC_APBWIN_ADDR_V << SLCHOST_SLC_APBWIN_ADDR_S)
#define SLCHOST_SLC_APBWIN_ADDR_V  0x0FFFFFFFU
#define SLCHOST_SLC_APBWIN_ADDR_S  0
/** SLCHOST_SLC_APBWIN_WR : R/W; bitpos: [28]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_WR    (BIT(28))
#define SLCHOST_SLC_APBWIN_WR_M  (SLCHOST_SLC_APBWIN_WR_V << SLCHOST_SLC_APBWIN_WR_S)
#define SLCHOST_SLC_APBWIN_WR_V  0x00000001U
#define SLCHOST_SLC_APBWIN_WR_S  28
/** SLCHOST_SLC_APBWIN_START : R/W/SC; bitpos: [29]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_START    (BIT(29))
#define SLCHOST_SLC_APBWIN_START_M  (SLCHOST_SLC_APBWIN_START_V << SLCHOST_SLC_APBWIN_START_S)
#define SLCHOST_SLC_APBWIN_START_V  0x00000001U
#define SLCHOST_SLC_APBWIN_START_S  29

/** SLCHOST_SLC_APBWIN_RDATA_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_RDATA_REG (DR_REG_SLCHOST_BASE + 0x108)
/** SLCHOST_SLC_APBWIN_RDATA : RO; bitpos: [31:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC_APBWIN_RDATA    0xFFFFFFFFU
#define SLCHOST_SLC_APBWIN_RDATA_M  (SLCHOST_SLC_APBWIN_RDATA_V << SLCHOST_SLC_APBWIN_RDATA_S)
#define SLCHOST_SLC_APBWIN_RDATA_V  0xFFFFFFFFU
#define SLCHOST_SLC_APBWIN_RDATA_S  0

/** SLCHOST_RDCLR0_REG register
 *  *******Description***********
 */
#define SLCHOST_RDCLR0_REG (DR_REG_SLCHOST_BASE + 0x10c)
/** SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR : R/W; bitpos: [8:0]; default: 68;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR    0x000001FFU
#define SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR_M  (SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR_V << SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR_S)
#define SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR_V  0x000001FFU
#define SLCHOST_SLCHOST_SLC0_BIT7_CLRADDR_S  0
/** SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR : R/W; bitpos: [17:9]; default: 480;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR    0x000001FFU
#define SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR_M  (SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR_V << SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR_S)
#define SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR_V  0x000001FFU
#define SLCHOST_SLCHOST_SLC0_BIT6_CLRADDR_S  9

/** SLCHOST_RDCLR1_REG register
 *  *******Description***********
 */
#define SLCHOST_RDCLR1_REG (DR_REG_SLCHOST_BASE + 0x110)
/** SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR : R/W; bitpos: [8:0]; default: 480;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR    0x000001FFU
#define SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR_M  (SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR_V << SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR_S)
#define SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR_V  0x000001FFU
#define SLCHOST_SLCHOST_SLC1_BIT7_CLRADDR_S  0
/** SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR : R/W; bitpos: [17:9]; default: 480;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR    0x000001FFU
#define SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR_M  (SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR_V << SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR_S)
#define SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR_V  0x000001FFU
#define SLCHOST_SLCHOST_SLC1_BIT6_CLRADDR_S  9

/** SLCHOST_SLC0HOST_INT_ENA1_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_INT_ENA1_REG (DR_REG_SLCHOST_BASE + 0x114)
/** SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1 : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1    (BIT(0))
#define SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT0_INT_ENA1_S  0
/** SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1 : R/W; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1    (BIT(1))
#define SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT1_INT_ENA1_S  1
/** SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1 : R/W; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1    (BIT(2))
#define SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT2_INT_ENA1_S  2
/** SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1 : R/W; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1    (BIT(3))
#define SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT3_INT_ENA1_S  3
/** SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1 : R/W; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1    (BIT(4))
#define SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT4_INT_ENA1_S  4
/** SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1 : R/W; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1    (BIT(5))
#define SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT5_INT_ENA1_S  5
/** SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1 : R/W; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1    (BIT(6))
#define SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT6_INT_ENA1_S  6
/** SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1 : R/W; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1    (BIT(7))
#define SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1_M  (SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1_V << SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1_S)
#define SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOHOST_BIT7_INT_ENA1_S  7
/** SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1 : R/W; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1    (BIT(8))
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1_M  (SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1_V << SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1_S)
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOKEN0_1TO0_INT_ENA1_S  8
/** SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1 : R/W; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1    (BIT(9))
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1_M  (SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1_V << SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1_S)
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOKEN1_1TO0_INT_ENA1_S  9
/** SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1 : R/W; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1    (BIT(10))
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1_M  (SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1_V << SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1_S)
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOKEN0_0TO1_INT_ENA1_S  10
/** SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1 : R/W; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1    (BIT(11))
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1_M  (SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1_V << SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1_S)
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TOKEN1_0TO1_INT_ENA1_S  11
/** SLCHOST_SLC0HOST_RX_SOF_INT_ENA1 : R/W; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_SOF_INT_ENA1    (BIT(12))
#define SLCHOST_SLC0HOST_RX_SOF_INT_ENA1_M  (SLCHOST_SLC0HOST_RX_SOF_INT_ENA1_V << SLCHOST_SLC0HOST_RX_SOF_INT_ENA1_S)
#define SLCHOST_SLC0HOST_RX_SOF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_SOF_INT_ENA1_S  12
/** SLCHOST_SLC0HOST_RX_EOF_INT_ENA1 : R/W; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_EOF_INT_ENA1    (BIT(13))
#define SLCHOST_SLC0HOST_RX_EOF_INT_ENA1_M  (SLCHOST_SLC0HOST_RX_EOF_INT_ENA1_V << SLCHOST_SLC0HOST_RX_EOF_INT_ENA1_S)
#define SLCHOST_SLC0HOST_RX_EOF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_EOF_INT_ENA1_S  13
/** SLCHOST_SLC0HOST_RX_START_INT_ENA1 : R/W; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_RX_START_INT_ENA1    (BIT(14))
#define SLCHOST_SLC0HOST_RX_START_INT_ENA1_M  (SLCHOST_SLC0HOST_RX_START_INT_ENA1_V << SLCHOST_SLC0HOST_RX_START_INT_ENA1_S)
#define SLCHOST_SLC0HOST_RX_START_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0HOST_RX_START_INT_ENA1_S  14
/** SLCHOST_SLC0HOST_TX_START_INT_ENA1 : R/W; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0HOST_TX_START_INT_ENA1    (BIT(15))
#define SLCHOST_SLC0HOST_TX_START_INT_ENA1_M  (SLCHOST_SLC0HOST_TX_START_INT_ENA1_V << SLCHOST_SLC0HOST_TX_START_INT_ENA1_S)
#define SLCHOST_SLC0HOST_TX_START_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0HOST_TX_START_INT_ENA1_S  15
/** SLCHOST_SLC0_RX_UDF_INT_ENA1 : R/W; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_UDF_INT_ENA1    (BIT(16))
#define SLCHOST_SLC0_RX_UDF_INT_ENA1_M  (SLCHOST_SLC0_RX_UDF_INT_ENA1_V << SLCHOST_SLC0_RX_UDF_INT_ENA1_S)
#define SLCHOST_SLC0_RX_UDF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_RX_UDF_INT_ENA1_S  16
/** SLCHOST_SLC0_TX_OVF_INT_ENA1 : R/W; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_TX_OVF_INT_ENA1    (BIT(17))
#define SLCHOST_SLC0_TX_OVF_INT_ENA1_M  (SLCHOST_SLC0_TX_OVF_INT_ENA1_V << SLCHOST_SLC0_TX_OVF_INT_ENA1_S)
#define SLCHOST_SLC0_TX_OVF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_TX_OVF_INT_ENA1_S  17
/** SLCHOST_SLC0_RX_PF_VALID_INT_ENA1 : R/W; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_PF_VALID_INT_ENA1    (BIT(18))
#define SLCHOST_SLC0_RX_PF_VALID_INT_ENA1_M  (SLCHOST_SLC0_RX_PF_VALID_INT_ENA1_V << SLCHOST_SLC0_RX_PF_VALID_INT_ENA1_S)
#define SLCHOST_SLC0_RX_PF_VALID_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_RX_PF_VALID_INT_ENA1_S  18
/** SLCHOST_SLC0_EXT_BIT0_INT_ENA1 : R/W; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT0_INT_ENA1    (BIT(19))
#define SLCHOST_SLC0_EXT_BIT0_INT_ENA1_M  (SLCHOST_SLC0_EXT_BIT0_INT_ENA1_V << SLCHOST_SLC0_EXT_BIT0_INT_ENA1_S)
#define SLCHOST_SLC0_EXT_BIT0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT0_INT_ENA1_S  19
/** SLCHOST_SLC0_EXT_BIT1_INT_ENA1 : R/W; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT1_INT_ENA1    (BIT(20))
#define SLCHOST_SLC0_EXT_BIT1_INT_ENA1_M  (SLCHOST_SLC0_EXT_BIT1_INT_ENA1_V << SLCHOST_SLC0_EXT_BIT1_INT_ENA1_S)
#define SLCHOST_SLC0_EXT_BIT1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT1_INT_ENA1_S  20
/** SLCHOST_SLC0_EXT_BIT2_INT_ENA1 : R/W; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT2_INT_ENA1    (BIT(21))
#define SLCHOST_SLC0_EXT_BIT2_INT_ENA1_M  (SLCHOST_SLC0_EXT_BIT2_INT_ENA1_V << SLCHOST_SLC0_EXT_BIT2_INT_ENA1_S)
#define SLCHOST_SLC0_EXT_BIT2_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT2_INT_ENA1_S  21
/** SLCHOST_SLC0_EXT_BIT3_INT_ENA1 : R/W; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_EXT_BIT3_INT_ENA1    (BIT(22))
#define SLCHOST_SLC0_EXT_BIT3_INT_ENA1_M  (SLCHOST_SLC0_EXT_BIT3_INT_ENA1_V << SLCHOST_SLC0_EXT_BIT3_INT_ENA1_S)
#define SLCHOST_SLC0_EXT_BIT3_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_EXT_BIT3_INT_ENA1_S  22
/** SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1 : R/W; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1    (BIT(23))
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1_M  (SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1_V << SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1_S)
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_RX_NEW_PACKET_INT_ENA1_S  23
/** SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1 : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1    (BIT(24))
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1_M  (SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1_V << SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1_S)
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC0_HOST_RD_RETRY_INT_ENA1_S  24
/** SLCHOST_GPIO_SDIO_INT_ENA1 : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_GPIO_SDIO_INT_ENA1    (BIT(25))
#define SLCHOST_GPIO_SDIO_INT_ENA1_M  (SLCHOST_GPIO_SDIO_INT_ENA1_V << SLCHOST_GPIO_SDIO_INT_ENA1_S)
#define SLCHOST_GPIO_SDIO_INT_ENA1_V  0x00000001U
#define SLCHOST_GPIO_SDIO_INT_ENA1_S  25

