espressif/esp-idf/components/soc/esp32c6/include/soc/host_reg.h
/** SLCHOST_SLC1HOST_INT_ENA1_REG register
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_INT_ENA1_REG (DR_REG_SLCHOST_BASE + 0x118)
/** SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1 : R/W; bitpos: [0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1    (BIT(0))
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT0_INT_ENA1_S  0
/** SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1 : R/W; bitpos: [1]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1    (BIT(1))
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT1_INT_ENA1_S  1
/** SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1 : R/W; bitpos: [2]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1    (BIT(2))
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT2_INT_ENA1_S  2
/** SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1 : R/W; bitpos: [3]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1    (BIT(3))
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT3_INT_ENA1_S  3
/** SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1 : R/W; bitpos: [4]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1    (BIT(4))
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT4_INT_ENA1_S  4
/** SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1 : R/W; bitpos: [5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1    (BIT(5))
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT5_INT_ENA1_S  5
/** SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1 : R/W; bitpos: [6]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1    (BIT(6))
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT6_INT_ENA1_S  6
/** SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1 : R/W; bitpos: [7]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1    (BIT(7))
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1_M  (SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1_V << SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1_S)
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOHOST_BIT7_INT_ENA1_S  7
/** SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1 : R/W; bitpos: [8]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1    (BIT(8))
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1_M  (SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1_V << SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1_S)
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_1TO0_INT_ENA1_S  8
/** SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1 : R/W; bitpos: [9]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1    (BIT(9))
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1_M  (SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1_V << SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1_S)
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_1TO0_INT_ENA1_S  9
/** SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1 : R/W; bitpos: [10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1    (BIT(10))
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1_M  (SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1_V << SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1_S)
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOKEN0_0TO1_INT_ENA1_S  10
/** SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1 : R/W; bitpos: [11]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1    (BIT(11))
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1_M  (SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1_V << SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1_S)
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TOKEN1_0TO1_INT_ENA1_S  11
/** SLCHOST_SLC1HOST_RX_SOF_INT_ENA1 : R/W; bitpos: [12]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_SOF_INT_ENA1    (BIT(12))
#define SLCHOST_SLC1HOST_RX_SOF_INT_ENA1_M  (SLCHOST_SLC1HOST_RX_SOF_INT_ENA1_V << SLCHOST_SLC1HOST_RX_SOF_INT_ENA1_S)
#define SLCHOST_SLC1HOST_RX_SOF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_SOF_INT_ENA1_S  12
/** SLCHOST_SLC1HOST_RX_EOF_INT_ENA1 : R/W; bitpos: [13]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_EOF_INT_ENA1    (BIT(13))
#define SLCHOST_SLC1HOST_RX_EOF_INT_ENA1_M  (SLCHOST_SLC1HOST_RX_EOF_INT_ENA1_V << SLCHOST_SLC1HOST_RX_EOF_INT_ENA1_S)
#define SLCHOST_SLC1HOST_RX_EOF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_EOF_INT_ENA1_S  13
/** SLCHOST_SLC1HOST_RX_START_INT_ENA1 : R/W; bitpos: [14]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_RX_START_INT_ENA1    (BIT(14))
#define SLCHOST_SLC1HOST_RX_START_INT_ENA1_M  (SLCHOST_SLC1HOST_RX_START_INT_ENA1_V << SLCHOST_SLC1HOST_RX_START_INT_ENA1_S)
#define SLCHOST_SLC1HOST_RX_START_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1HOST_RX_START_INT_ENA1_S  14
/** SLCHOST_SLC1HOST_TX_START_INT_ENA1 : R/W; bitpos: [15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1HOST_TX_START_INT_ENA1    (BIT(15))
#define SLCHOST_SLC1HOST_TX_START_INT_ENA1_M  (SLCHOST_SLC1HOST_TX_START_INT_ENA1_V << SLCHOST_SLC1HOST_TX_START_INT_ENA1_S)
#define SLCHOST_SLC1HOST_TX_START_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1HOST_TX_START_INT_ENA1_S  15
/** SLCHOST_SLC1_RX_UDF_INT_ENA1 : R/W; bitpos: [16]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_UDF_INT_ENA1    (BIT(16))
#define SLCHOST_SLC1_RX_UDF_INT_ENA1_M  (SLCHOST_SLC1_RX_UDF_INT_ENA1_V << SLCHOST_SLC1_RX_UDF_INT_ENA1_S)
#define SLCHOST_SLC1_RX_UDF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_RX_UDF_INT_ENA1_S  16
/** SLCHOST_SLC1_TX_OVF_INT_ENA1 : R/W; bitpos: [17]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_TX_OVF_INT_ENA1    (BIT(17))
#define SLCHOST_SLC1_TX_OVF_INT_ENA1_M  (SLCHOST_SLC1_TX_OVF_INT_ENA1_V << SLCHOST_SLC1_TX_OVF_INT_ENA1_S)
#define SLCHOST_SLC1_TX_OVF_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_TX_OVF_INT_ENA1_S  17
/** SLCHOST_SLC1_RX_PF_VALID_INT_ENA1 : R/W; bitpos: [18]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_RX_PF_VALID_INT_ENA1    (BIT(18))
#define SLCHOST_SLC1_RX_PF_VALID_INT_ENA1_M  (SLCHOST_SLC1_RX_PF_VALID_INT_ENA1_V << SLCHOST_SLC1_RX_PF_VALID_INT_ENA1_S)
#define SLCHOST_SLC1_RX_PF_VALID_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_RX_PF_VALID_INT_ENA1_S  18
/** SLCHOST_SLC1_EXT_BIT0_INT_ENA1 : R/W; bitpos: [19]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT0_INT_ENA1    (BIT(19))
#define SLCHOST_SLC1_EXT_BIT0_INT_ENA1_M  (SLCHOST_SLC1_EXT_BIT0_INT_ENA1_V << SLCHOST_SLC1_EXT_BIT0_INT_ENA1_S)
#define SLCHOST_SLC1_EXT_BIT0_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT0_INT_ENA1_S  19
/** SLCHOST_SLC1_EXT_BIT1_INT_ENA1 : R/W; bitpos: [20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT1_INT_ENA1    (BIT(20))
#define SLCHOST_SLC1_EXT_BIT1_INT_ENA1_M  (SLCHOST_SLC1_EXT_BIT1_INT_ENA1_V << SLCHOST_SLC1_EXT_BIT1_INT_ENA1_S)
#define SLCHOST_SLC1_EXT_BIT1_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT1_INT_ENA1_S  20
/** SLCHOST_SLC1_EXT_BIT2_INT_ENA1 : R/W; bitpos: [21]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT2_INT_ENA1    (BIT(21))
#define SLCHOST_SLC1_EXT_BIT2_INT_ENA1_M  (SLCHOST_SLC1_EXT_BIT2_INT_ENA1_V << SLCHOST_SLC1_EXT_BIT2_INT_ENA1_S)
#define SLCHOST_SLC1_EXT_BIT2_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT2_INT_ENA1_S  21
/** SLCHOST_SLC1_EXT_BIT3_INT_ENA1 : R/W; bitpos: [22]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_EXT_BIT3_INT_ENA1    (BIT(22))
#define SLCHOST_SLC1_EXT_BIT3_INT_ENA1_M  (SLCHOST_SLC1_EXT_BIT3_INT_ENA1_V << SLCHOST_SLC1_EXT_BIT3_INT_ENA1_S)
#define SLCHOST_SLC1_EXT_BIT3_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_EXT_BIT3_INT_ENA1_S  22
/** SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1 : R/W; bitpos: [23]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1    (BIT(23))
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_M  (SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_V << SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_S)
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_WIFI_RX_NEW_PACKET_INT_ENA1_S  23
/** SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1 : R/W; bitpos: [24]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1    (BIT(24))
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1_M  (SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1_V << SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1_S)
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_HOST_RD_RETRY_INT_ENA1_S  24
/** SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1 : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1    (BIT(25))
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_M  (SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_V << SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_S)
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_V  0x00000001U
#define SLCHOST_SLC1_BT_RX_NEW_PACKET_INT_ENA1_S  25

/** SLCHOST_SLCHOSTDATE_REG register
 *  *******Description***********
 */
#define SLCHOST_SLCHOSTDATE_REG (DR_REG_SLCHOST_BASE + 0x178)
/** SLCHOST_SLCHOST_DATE : R/W; bitpos: [31:0]; default: 554043136;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_DATE    0xFFFFFFFFU
#define SLCHOST_SLCHOST_DATE_M  (SLCHOST_SLCHOST_DATE_V << SLCHOST_SLCHOST_DATE_S)
#define SLCHOST_SLCHOST_DATE_V  0xFFFFFFFFU
#define SLCHOST_SLCHOST_DATE_S  0

/** SLCHOST_SLCHOSTID_REG register
 *  *******Description***********
 */
#define SLCHOST_SLCHOSTID_REG (DR_REG_SLCHOST_BASE + 0x17c)
/** SLCHOST_SLCHOST_ID : R/W; bitpos: [31:0]; default: 1536;
 *  *******Description***********
 */
#define SLCHOST_SLCHOST_ID    0xFFFFFFFFU
#define SLCHOST_SLCHOST_ID_M  (SLCHOST_SLCHOST_ID_V << SLCHOST_SLCHOST_ID_S)
#define SLCHOST_SLCHOST_ID_V  0xFFFFFFFFU
#define SLCHOST_SLCHOST_ID_S  0

/** SLCHOST_CONF_REG register
 *  *******Description***********
 */
#define SLCHOST_CONF_REG (DR_REG_SLCHOST_BASE + 0x1f0)
/** SLCHOST_FRC_SDIO11 : R/W; bitpos: [4:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FRC_SDIO11    0x0000001FU
#define SLCHOST_FRC_SDIO11_M  (SLCHOST_FRC_SDIO11_V << SLCHOST_FRC_SDIO11_S)
#define SLCHOST_FRC_SDIO11_V  0x0000001FU
#define SLCHOST_FRC_SDIO11_S  0
/** SLCHOST_FRC_SDIO20 : R/W; bitpos: [9:5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FRC_SDIO20    0x0000001FU
#define SLCHOST_FRC_SDIO20_M  (SLCHOST_FRC_SDIO20_V << SLCHOST_FRC_SDIO20_S)
#define SLCHOST_FRC_SDIO20_V  0x0000001FU
#define SLCHOST_FRC_SDIO20_S  5
/** SLCHOST_FRC_NEG_SAMP : R/W; bitpos: [14:10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FRC_NEG_SAMP    0x0000001FU
#define SLCHOST_FRC_NEG_SAMP_M  (SLCHOST_FRC_NEG_SAMP_V << SLCHOST_FRC_NEG_SAMP_S)
#define SLCHOST_FRC_NEG_SAMP_V  0x0000001FU
#define SLCHOST_FRC_NEG_SAMP_S  10
/** SLCHOST_FRC_POS_SAMP : R/W; bitpos: [19:15]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FRC_POS_SAMP    0x0000001FU
#define SLCHOST_FRC_POS_SAMP_M  (SLCHOST_FRC_POS_SAMP_V << SLCHOST_FRC_POS_SAMP_S)
#define SLCHOST_FRC_POS_SAMP_V  0x0000001FU
#define SLCHOST_FRC_POS_SAMP_S  15
/** SLCHOST_FRC_QUICK_IN : R/W; bitpos: [24:20]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_FRC_QUICK_IN    0x0000001FU
#define SLCHOST_FRC_QUICK_IN_M  (SLCHOST_FRC_QUICK_IN_V << SLCHOST_FRC_QUICK_IN_S)
#define SLCHOST_FRC_QUICK_IN_V  0x0000001FU
#define SLCHOST_FRC_QUICK_IN_S  20
/** SLCHOST_SDIO20_INT_DELAY : R/W; bitpos: [25]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SDIO20_INT_DELAY    (BIT(25))
#define SLCHOST_SDIO20_INT_DELAY_M  (SLCHOST_SDIO20_INT_DELAY_V << SLCHOST_SDIO20_INT_DELAY_S)
#define SLCHOST_SDIO20_INT_DELAY_V  0x00000001U
#define SLCHOST_SDIO20_INT_DELAY_S  25
/** SLCHOST_SDIO_PAD_PULLUP : R/W; bitpos: [26]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SDIO_PAD_PULLUP    (BIT(26))
#define SLCHOST_SDIO_PAD_PULLUP_M  (SLCHOST_SDIO_PAD_PULLUP_V << SLCHOST_SDIO_PAD_PULLUP_S)
#define SLCHOST_SDIO_PAD_PULLUP_V  0x00000001U
#define SLCHOST_SDIO_PAD_PULLUP_S  26
/** SLCHOST_HSPEED_CON_EN : R/W; bitpos: [27]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_HSPEED_CON_EN    (BIT(27))
#define SLCHOST_HSPEED_CON_EN_M  (SLCHOST_HSPEED_CON_EN_V << SLCHOST_HSPEED_CON_EN_S)
#define SLCHOST_HSPEED_CON_EN_V  0x00000001U
#define SLCHOST_HSPEED_CON_EN_S  27

/** SLCHOST_INF_ST_REG register
 *  *******Description***********
 */
#define SLCHOST_INF_ST_REG (DR_REG_SLCHOST_BASE + 0x1f4)
/** SLCHOST_SDIO20_MODE : RO; bitpos: [4:0]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SDIO20_MODE    0x0000001FU
#define SLCHOST_SDIO20_MODE_M  (SLCHOST_SDIO20_MODE_V << SLCHOST_SDIO20_MODE_S)
#define SLCHOST_SDIO20_MODE_V  0x0000001FU
#define SLCHOST_SDIO20_MODE_S  0
/** SLCHOST_SDIO_NEG_SAMP : RO; bitpos: [9:5]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SDIO_NEG_SAMP    0x0000001FU
#define SLCHOST_SDIO_NEG_SAMP_M  (SLCHOST_SDIO_NEG_SAMP_V << SLCHOST_SDIO_NEG_SAMP_S)
#define SLCHOST_SDIO_NEG_SAMP_V  0x0000001FU
#define SLCHOST_SDIO_NEG_SAMP_S  5
/** SLCHOST_SDIO_QUICK_IN : RO; bitpos: [14:10]; default: 0;
 *  *******Description***********
 */
#define SLCHOST_SDIO_QUICK_IN    0x0000001FU
#define SLCHOST_SDIO_QUICK_IN_M  (SLCHOST_SDIO_QUICK_IN_V << SLCHOST_SDIO_QUICK_IN_S)
#define SLCHOST_SDIO_QUICK_IN_V  0x0000001FU
#define SLCHOST_SDIO_QUICK_IN_S  10
/** SLCHOST_DLL_ON_SW : R/W; bitpos: [15]; default: 0;
 *  dll is controlled by software
 */
#define SLCHOST_DLL_ON_SW    (BIT(15))
#define SLCHOST_DLL_ON_SW_M  (SLCHOST_DLL_ON_SW_V << SLCHOST_DLL_ON_SW_S)
#define SLCHOST_DLL_ON_SW_V  0x00000001U
#define SLCHOST_DLL_ON_SW_S  15
/** SLCHOST_DLL_ON : R/W; bitpos: [16]; default: 0;
 *  Software dll on
 */
#define SLCHOST_DLL_ON    (BIT(16))
#define SLCHOST_DLL_ON_M  (SLCHOST_DLL_ON_V << SLCHOST_DLL_ON_S)
#define SLCHOST_DLL_ON_V  0x00000001U
#define SLCHOST_DLL_ON_S  16
/** SLCHOST_CLK_MODE_SW : R/W; bitpos: [17]; default: 0;
 *  dll clock mode is controlled by software
 */
#define SLCHOST_CLK_MODE_SW    (BIT(17))
#define SLCHOST_CLK_MODE_SW_M  (SLCHOST_CLK_MODE_SW_V << SLCHOST_CLK_MODE_SW_S)
#define SLCHOST_CLK_MODE_SW_V  0x00000001U
#define SLCHOST_CLK_MODE_SW_S  17
/** SLCHOST_CLK_MODE : R/W; bitpos: [19:18]; default: 0;
 *  Software set clock mode
 */
#define SLCHOST_CLK_MODE    0x00000003U
#define SLCHOST_CLK_MODE_M  (SLCHOST_CLK_MODE_V << SLCHOST_CLK_MODE_S)
#define SLCHOST_CLK_MODE_V  0x00000003U
#define SLCHOST_CLK_MODE_S  18

#ifdef __cplusplus
}
#endif
